
const output = document.getElementsByClassName('output')[0]; 

function content_load(buttonId) {
    let content = '';
    
  
    switch (buttonId) {
        case 'btn1':
            content = `
            <h1>Оборонна спроможность США</h1>
            <p style="padding:5px;">   Веб сайту надає інформацію про військову спроможність армії США. Сайт орієнтований на широкий загал, але також може бути корисним для аналітиків. Він включатиме кілька основних розділів, таких як структура армії, склад армії, озброєння, історія армії та карта військових об’єктів. Основна навігація буде організована через меню, де кожен із цих розділів матиме свою окрему сторінку.
        Особлива увага приділяється розділу "Озброєння", де буде реалізовано можливість фільтрації інформації за кількома параметрами, такими як тип озброєння (наприклад, танки, авіація, піхота), рік введення в експлуатацію та його статус (активне чи резервне використання) також буде додана інноваційна зброя, яку пізніше можуть ввести в експлуатацію. Інтерактивність також може бути додана до інших розділів, наприклад, у розділі "Історія армії" можна реалізувати фільтрацію за періодами або ключовими подіями. Крім того, на окремих сторінках сайту буде функція пошуку, що дозволить користувачам швидко знаходити необхідну інформацію.         
        На початковому етапі на сайті буде представлена статична карта військових об’єктів армії США. Вона слугуватиме візуальним доповненням до інформації про розташування баз і важливих об’єктів, надаючи можливість користувачам збільшувати зображення та переглядати додаткові підписи з описами. У майбутньому планується розглянути можливість переходу до інтерактивної карти, яка дозволить отримувати більше детальної інформації безпосередньо з мапи.         
        Контент сайту не планується оновлювати часто, тому не передбачено складних механізмів для адміністрування.</p>
        
       <h2> Сценарій бізнес-логіки для сайту про військову спроможність армії США</h2>
       <ol>
<li> <h3>Головна навігація через меню</h3>
Користувач має можливість перемикатися між основними розділами сайту: "Структура армії", "Склад армії", "Озброєння", "Історія армії", "Карта військових об’єктів".
Кожен розділ містить відповідний контент та функції, що надають доступ до необхідної інформації. </li>
<li> <h3>Розділ "Озброєння"</h3>
Фільтрація: Користувачі можуть фільтрувати інформацію за параметрами: тип озброєння (танки, авіація, піхота тощо), рік введення в експлуатацію, статус (активне чи резервне), а також інноваційне озброєння, яке може бути введене в експлуатацію в майбутньому.
Пошук: Кожна сторінка розділу матиме поле пошуку, яке дозволяє швидко знайти необхідне озброєння або його характеристики.</li>
 <li> <h3>Розділ "Історія армії"</h3>
Фільтрація: Користувачі можуть фільтрувати історичні дані за періодами (наприклад, Друга світова війна, Холодна війна) або за ключовими подіями.
Це дозволяє краще дослідити розвиток армії в різні історичні періоди.</li>
 <li> <h3>Розділ "Карта військових об’єктів"</h3>
Статична карта: На початковому етапі карта є статичною, але інтерактивні елементи дозволяють збільшувати зображення та переглядати додаткові підписи з описами військових баз та об’єктів.
Інтерактивна карта (майбутнє оновлення): У перспективі можливий перехід до інтерактивної карти, яка дозволить отримувати детальну інформацію про об'єкти безпосередньо з мапи.</li>
 <li> <h3>Пошук на сайті </h3>
Кожен розділ має функцію пошуку, що дозволяє швидко знаходити інформацію про структуру армії, склад, озброєння, історичні події тощо.</li>
  <li> <h3>Оновлення контенту </h3>
Оскільки контент не планується часто оновлювати, адміністрування сайту буде спрощеним, без складних механізмів для управління даними.</li>
<li> <h3>Перспективи розвитку</h3>
Інтерактивні функції: У перспективі інтерактивність може бути додана до інших розділів, зокрема до історичних подій та озброєння, що дозволить користувачам отримувати більш детальну інформацію. </li>`;
            break;
        case 'btn2':
            content = `Тема: СТРУКТУРА HTML-ДОКУМЕНТА. ВИБІР ПРЕДМЕТНОЇ ГАЛУЗІ.РОБОТА З ПОСИЛАННЯМИ, ТАБЛИЦЯМИ, ЗОБРАЖЕННЯМИ, СПИСКАМИ в HTML-ДОКУМЕНТІ.<br><br>           
Мета: придбати практичні навички роботи  з HTML-документом, таблицями, , зображеннями, посиланнями, списками, формами. Створити шаблон звітного HTML-документом для відображення результатів роботи всіх лабораторних робіт.<br><br>
ЛР_1:

    <a href ="https://github.com/OleksiiAnokhin2023/IS-31_Anokhin_laba_1.git" target="_blank">репозиторій</a>  і
    <a href ="https://oleksiianokhin2023.github.io/IS-31_Anokhin_laba_1" target="_blank">живий сайт</a> <br><br>   

СР_1:
    <a href ="https://github.com/OleksiiAnokhin2023/IS-31_Anokhin_sr1.git" target="_blank">репозиторій</a> і
    <a href ="https://oleksiianokhin2023.github.io/IS-31_Anokhin_sr1" target="_blank">живий сайт</a> <br> <br> 
Звіт_html:
    <a href ="https://github.com/OleksiiAnokhin2023/IS-31_Anokhin_report_html.git" target="_blank">репозиторій</a> і
    <a href ="https://oleksiianokhin2023.github.io/IS-31_Anokhin_report_html" target="_blank">живий сайт</a> <br> <br> 
`;
            break;
        case 'btn3':
            content = `<textarea rows="155" cols="100">
            <!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css">
    <title>Document</title>
</head>
<body>
    <header></header>
    <main>
        <img src="phorm.webp" alt="">
        <table>
            <tr>
                <th>Модель</th>
                <th>тип</th>
                <th>дальнобойность</th>
                <th>точность</th>
                <th>дополнительное снаряжение</th>
                <th>начало експлоутации</th>
            </tr>
            <tr>
                <td>M4 Carbine</td>
                <td>Карабин</td>
                <td>500-600 метров (эффективная)</td>
                <td>Высокая на коротких и средних дистанциях</td>
                <td>Оптические прицелы, глушитель, подствольный гранатомет M203, лазерные целеуказатели</td>
                <td>1994 год</td>
            </tr>
            <tr>
                <td>M16A4 Rifle</td>
                <td>Автоматическая винтовка</td>
                <td>550 метров (эффективная)</td>
                <td>Высокая на средних и дальних дистанциях</td>
                <td>Оптические прицелы ACOG, лазерные целеуказатели, глушитель</td>
                <td>1997 год</td>
            </tr>
            <tr>
                <td>M249 SAW (Squad Automatic Weapon)</td>
                <td>Легкий пулемет</td>
                <td>800 метров (эффективная)</td>
                <td>Средняя</td>
                <td>Оптический прицел, лазерные целеуказатели, складной сошник</td>
                <td>1984 год</td>
            </tr>
            <tr>
                <td>M2010 Enhanced Sniper Rifle</td>
                <td>Снайперская винтовка</td>
                <td>1200 метров (эффективная)</td>
                <td>Очень высокая</td>
                <td>Оптический прицел, глушитель ,  сошник</td>
                <td>2010 год</td>
            </tr>
            <tr>
                <td>M2010 Enhanced Sniper Rifle</td>
                <td>Снайперская винтовка</td>
                <td>1200 метров (эффективная)</td>
                <td>Очень высокая</td>
                <td>Оптический прицел, глушитель, сошник</td>
                <td>2010 год</td>
            </tr>
        </table>
    <br><br><br>
    <p>
        <mark style="font-size: 180%"><strong >Основные роли в батальоне</strong></mark>
    <ol>
            <li><b> Командир батальона <small>(Battalion Commander)</small>:</b></li>
            <ul>
                <li><i>Звание:</i> Подполковник <small>(Lieutenant Colonel)</small></li>
                <li><i>Ответственность:</i> Общее командование батальоном, принятие решений по тактике и стратегии, взаимодействие с вышестоящими командующими.</li>
            </ul>
            <li><b>Заместитель командира батальона <small> (Executive Officer, XO)</small>:</b></li>
            <ul>
                <li><i>Звание:</i> Майор <small>(Major)</small></li>
                <li><i>Ответственность:</i> Административное управление, помощь командиру батальона, координация работы штабного персонала.</li>
            </ul>
            <li> <b>Сержант-майор батальона <small>(Command Sergeant Major)</small>:</b></li>
            <ul>
                <li><i>Звание:</i> Сержант-майор <sup>(Command Sergeant Major)</sup></li>  
                <li><i>Ответственность:</i> Руководство сержантами, поддержание дисциплины и стандартов выполнения задач, советник командира по вопросам личного состава.</li> 
            </ul>
            <li><b>Офицер по операциям <small>(Operations Officer, S3)</small>:</b></li>
            <ul>
                <li> <i>Звание:</i> Майор или капитан <small>(Major/Captain)</small></li>
                <li><i>Ответственность:</i> Планирование и координация операций, разработка тактических планов, управление учениями и тренировками.</li>
            </ul>
            <li><b>Офицер по логистике <small>(Logistics Officer, S4):</small></b></li>
            <ul>
                <li><i>Звание:</i> Капитан <small>(Captain)</small></li>
                <li><i>Ответственность:</i> Управление снабжением, транспортом и материально-техническим обеспечением батальона.</li>
            </ul>
            <li><b>Офицер по разведке <small>(Intelligence Officer, S2)</small>:</b></li>
            <ul>
                <li><i>Звание:</i> Капитан или лейтенант <small>(Captain/Lieutenant)</small></li>
                <li><i>Ответственность:</i> Сбор и анализ разведывательной информации, обеспечение безопасности информации.</li>
            </ul>
            <li><b>Офицер по персоналу <small>(Personnel Officer, S1)</small>:</b></li>
            <ul>
                <li><i>Звание:</i> Капитан или лейтенант <small>(Captain/Lieutenant)</small></li>
                <li><i>Ответственность:</i> Управление кадровыми вопросами, администрирование личного состава, моральное состояние солдат.</li>
            </ul>
            <li> <b>Офицер по гражданским делам <small>(Civil Affairs Officer)</small>:</b></li>
            <ul>
                <li><i>Звание:</i> Капитан или лейтенант <small>(Captain/Lieutenant)</small></li>
                <li><i>Ответственность:</i> Координация взаимодействия с гражданским населением и местными властями в зоне операций.</li>
            </ul>
    </ol>

        <mark style="font-size: 180%"><strong >Структура батальона</strong></mark>
    Батальон обычно включает несколько рот:  
        Командная рота (Headquarters Company):
        
        Обеспечивает <a href="https://ru.wikipedia.org/wiki/%D0%A8%D1%82%D0%B0%D0%B1">штабные функции</a>x и поддержку командования.
        Включает секции по планированию, связи и управлению огнём.
        Боевые роты (Line Companies):
        
        Несколько рот, в зависимости от типа батальона (например, пехотный, танковый).
        Каждая рота выполняет свои специализированные задачи, такие как штурмовые действия или оборона.
        Подразделения поддержки (Support Units):
        
        Могут включать медиков, инженеров и артиллерийские подразделения, обеспечивающие боевую и техническую поддержку.
        Дополнительные ключевые роли
        Старший медицинский офицер (Senior Medical Officer): Управляет медицинской службой батальона, обеспечивает медицинскую помощь.
        Офицер по связи (Communications Officer): Обеспечивает связь и координацию внутри батальона и с вышестоящими подразделениями.
        Батальон действует как целостная единица, где каждая роль и подразделение дополняют друг друга, обеспечивая эффективность и боеспособность в различных условиях.</p>
        <h1>my name Aloshka</h1>
        <h2>fdjdofoo</h2>
    
        <a href="https://www.youtube.com/">youtube</a>
        <br>
        <form>
            <fieldset>
                <legend>Registration</legend>
                name <br>
                <input type="text" name="first_name "> <br><br>
                sirname <br>
                <input type="text" name="second_name"> <br> <br>
                <input type="submit" value="Надіслати">
            </fieldset>
        </form>
        <br><br><br>
        <button onclick="window.location.href='business_plan.html';">Watch Business Plan</button>
    </main>
    <footer></footer>
</body>
</html></textarea> `;
            break;
        case 'btn4':
            content = `<textarea rows="60" cols="115"><table>
            <tr>
                <th>Модель</th>
                <th>тип</th>
                <th>дальнобойность</th>
                <th>точность</th>
                <th>дополнительное снаряжение</th>
                <th>начало експлоутации</th>
            </tr>
            <tr>
                <td>M4 Carbine</td>
                <td>Карабин</td>
                <td>500-600 метров (эффективная)</td>
                <td>Высокая на коротких и средних дистанциях</td>
                <td>Оптические прицелы, глушитель, подствольный гранатомет M203, лазерные целеуказатели</td>
                <td>1994 год</td>
            </tr>
            <tr>
                <td>M16A4 Rifle</td>
                <td>Автоматическая винтовка</td>
                <td>550 метров (эффективная)</td>
                <td>Высокая на средних и дальних дистанциях</td>
                <td>Оптические прицелы ACOG, лазерные целеуказатели, глушитель</td>
                <td>1997 год</td>
            </tr>
            <tr>
                <td>M249 SAW (Squad Automatic Weapon)</td>
                <td>Легкий пулемет</td>
                <td>800 метров (эффективная)</td>
                <td>Средняя</td>
                <td>Оптический прицел, лазерные целеуказатели, складной сошник</td>
                <td>1984 год</td>
            </tr>
            <tr>
                <td>M2010 Enhanced Sniper Rifle</td>
                <td>Снайперская винтовка</td>
                <td>1200 метров (эффективная)</td>
                <td>Очень высокая</td>
                <td>Оптический прицел, глушитель ,  сошник</td>
                <td>2010 год</td>
            </tr>
            <tr>
                <td>M2010 Enhanced Sniper Rifle</td>
                <td>Снайперская винтовка</td>
                <td>1200 метров (эффективная)</td>
                <td>Очень высокая</td>
                <td>Оптический прицел, глушитель, сошник</td>
                <td>2010 год</td>
            </tr>
        </table></textarea>
        <img src="img/lab1/image.png" alt="" style= "width:1000px;">`;
            break;
        case 'btn5':
            content = `<textarea rows="15" cols="80"><form>
            <fieldset>
                <legend>Registration</legend>
                name <br>
                <input type="text" name="first_name "> <br><br>
                sirname <br>
                <input type="text" name="second_name"> <br> <br>
                <input type="submit" value="Надіслати">
            </fieldset>
        </form></textarea>`;
            break;
        case 'btn6':
            content = `<textarea rows="1" cols="35"><img src="phorm.webp" alt=""></textarea>
            <img src="img/lab1/img.png" alt="" style= "width:1000px;">`;
            break;
        case 'btn7':
            content = `Я придбав практичні навички роботи  з HTML-документом, таблицями, , зображеннями, посиланнями, списками, формами
Створив шаблон звітного HTML-документом для відображення результатів роботи всіх лабораторних робіт.
`;
            break;
        default:
            content = 'Нет информации';
    }


    output.innerHTML = content;
}


document.querySelectorAll('button').forEach(button => {
    button.addEventListener('click', (event) => {
        content_load(event.target.id); 
    });
});
